Revit 2027 API
IFCExportElement Enumeration
 An enumerated type defining if an element is exported to IFC or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum IFCExportElement
Public Enumeration IFCExportElement
public enum class IFCExportElement
type IFCExportElement
Members
Member name | Value | Description
ByType | 0 |  Export element to IFC according to type settings.
No | 2 |  Don't export element to IFC regardless of type or category settings.
Yes | 1 |  Export element to IFC regardless of type or category settings.
See Also
Reference
Autodesk.Revit.DB Namespace